## Pandas Dataframe

In [2]:
import pandas as pd
import numpy as np

In [3]:
df2 = pd.DataFrame([[10,np.NaN,30], [40,50,np.NaN], [60,70,80], [np.NaN, np.NaN, np.NaN]])
df2

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [4]:
df2.dropna()

      0     1     2
2  60.0  70.0  80.0

In [5]:
df2.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [6]:
df2.dropna(axis=0)

      0     1     2
2  60.0  70.0  80.0

In [7]:
df2.dropna(thresh=2)

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0

In [10]:
df2.fillna(value=0)

      0     1     2
0  10.0   0.0  30.0
1  40.0  50.0   0.0
2  60.0  70.0  80.0
3   0.0   0.0   0.0

In [12]:
df2.fillna(0)

      0     1     2
0  10.0   0.0  30.0
1  40.0  50.0   0.0
2  60.0  70.0  80.0
3   0.0   0.0   0.0

In [13]:
df2.fillna(df2.mean())

           0     1     2
0  10.000000  60.0  30.0
1  40.000000  50.0  55.0
2  60.000000  70.0  80.0
3  36.666667  60.0  55.0

## Concatenating

In [15]:
from pandas import Series, DataFrame

### Series

In [16]:
ser1=Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [17]:
ser2=Series(np.arange(11, 13), index=['X', 'Y'])
ser2

X    11
Y    12
dtype: int32

In [18]:
pd.concat([ser1,ser2])

A     0
B     1
C     2
X    11
Y    12
dtype: int32

In [19]:
pd.concat([ser1,ser2], axis=1, sort=False)

     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0

In [21]:
pd.concat([ser1,ser2], axis=1, sort=True)

     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0

In [22]:
pd.concat([ser1,ser2], axis=0, sort=True)

A     0
B     1
C     2
X    11
Y    12
dtype: int32

In [23]:
pd.concat([ser1,ser2], keys=['Tab1', 'Tab2'])

Tab1  A     0
      B     1
      C     2
Tab2  X    11
      Y    12
dtype: int32

In [24]:
pd.concat([ser1,ser2], ignore_index=True)

0     0
1     1
2     2
3    11
4    12
dtype: int32

### DataFrames

In [25]:
df1=DataFrame(np.random.randn(4,3), columns=['X','Y','Z'])
df1

          X         Y         Z
0  0.011072  0.065351  1.159335
1 -1.438817  1.065784 -0.818595
2 -0.119562 -0.615573 -0.443545
3 -0.489719 -0.951007 -0.578923

In [26]:
df2=DataFrame(np.random.randn(4,1), columns=['W'])
df2

          W
0  1.690022
1  0.975375
2  0.415958
3 -0.631896

In [27]:
pd.concat([df1,df2])

          X         Y         Z         W
0  0.011072  0.065351  1.159335       NaN
1 -1.438817  1.065784 -0.818595       NaN
2 -0.119562 -0.615573 -0.443545       NaN
3 -0.489719 -0.951007 -0.578923       NaN
0       NaN       NaN       NaN  1.690022
1       NaN       NaN       NaN  0.975375
2       NaN       NaN       NaN  0.415958
3       NaN       NaN       NaN -0.631896

In [29]:
df3=DataFrame(np.arange(16).reshape(4,4), index=['a','b', 'c', 'e'],
             columns=['w','x','y','z'])
df3

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
e  12  13  14  15

In [32]:
df3.sort_index(axis=1)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
e  12  13  14  15

In [31]:
df3.sort_values(by='w', ascending=False)

    w   x   y   z
e  12  13  14  15
c   8   9  10  11
b   4   5   6   7
a   0   1   2   3